OpenAtomFoundation/TobudOS/platform/vendor_bsp/nxp/CH-K-Lib/startup/DeviceSupport/MK21D5.h
/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #pragma pop
#elif defined(__CWCC__)
  #pragma pop
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/**
 * @}
 */ /* end of group Peripheral_access_layer */


/* ----------------------------------------------------------------------------
   -- Backward Compatibility
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup Backward_Compatibility_Symbols Backward Compatibility
 * @{
 */

#define SIM_SCGC5_LPTIMER_MASK                   SIM_SCGC5_LPTMR_MASK
#define SIM_SCGC5_LPTIMER_SHIFT                  SIM_SCGC5_LPTMR_SHIFT
#define AIPS_MPRA_MPL3_MASK                      This_symbol_has_been_deprecated
#define AIPS_MPRA_MPL3_SHIFT                     This_symbol_has_been_deprecated
#define AIPS_MPRA_MTW3_MASK                      This_symbol_has_been_deprecated
#define AIPS_MPRA_MTW3_SHIFT                     This_symbol_has_been_deprecated
#define AIPS_MPRA_MTR3_MASK                      This_symbol_has_been_deprecated
#define AIPS_MPRA_MTR3_SHIFT                     This_symbol_has_been_deprecated
#define AIPS_MPRA_MPL2_MASK                      This_symbol_has_been_deprecated
#define AIPS_MPRA_MPL2_SHIFT                     This_symbol_has_been_deprecated
#define AIPS_MPRA_MTW2_MASK                      This_symbol_has_been_deprecated
#define AIPS_MPRA_MTW2_SHIFT                     This_symbol_has_been_deprecated
#define AIPS_MPRA_MTR2_MASK                      This_symbol_has_been_deprecated
#define AIPS_MPRA_MTR2_SHIFT                     This_symbol_has_been_deprecated
#define AIPS_MPRA_MPL1_MASK                      This_symbol_has_been_deprecated
#define AIPS_MPRA_MPL1_SHIFT                     This_symbol_has_been_deprecated
#define AIPS_MPRA_MTW1_MASK                      This_symbol_has_been_deprecated
#define AIPS_MPRA_MTW1_SHIFT                     This_symbol_has_been_deprecated
#define AIPS_MPRA_MTR1_MASK                      This_symbol_has_been_deprecated
#define AIPS_MPRA_MTR1_SHIFT                     This_symbol_has_been_deprecated
#define AIPS_MPRA_MPL0_MASK                      This_symbol_has_been_deprecated
#define AIPS_MPRA_MPL0_SHIFT                     This_symbol_has_been_deprecated
#define AIPS_MPRA_MTW0_MASK                      This_symbol_has_been_deprecated
#define AIPS_MPRA_MTW0_SHIFT                     This_symbol_has_been_deprecated
#define AIPS_MPRA_MTR0_MASK                      This_symbol_has_been_deprecated
#define AIPS_MPRA_MTR0_SHIFT                     This_symbol_has_been_deprecated
#define UART_C6_CP_MASK                          This_symbol_has_been_deprecated
#define UART_C6_CP_SHIFT                         This_symbol_has_been_deprecated
#define UART_C6_CE_MASK                          This_symbol_has_been_deprecated
#define UART_C6_CE_SHIFT                         This_symbol_has_been_deprecated
#define UART_C6_TX709_MASK                       This_symbol_has_been_deprecated
#define UART_C6_TX709_SHIFT                      This_symbol_has_been_deprecated
#define UART_C6_EN709_MASK                       This_symbol_has_been_deprecated
#define UART_C6_EN709_SHIFT                      This_symbol_has_been_deprecated
#define UART_PCTH_PCTH_MASK                      This_symbol_has_been_deprecated
#define UART_PCTH_PCTH_SHIFT                     This_symbol_has_been_deprecated
#define UART_PCTH_PCTH(x)                        This_symbol_has_been_deprecated
#define UART_PCTL_PCTL_MASK                      This_symbol_has_been_deprecated
#define UART_PCTL_PCTL_SHIFT                     This_symbol_has_been_deprecated
#define UART_PCTL_PCTL(x)                        This_symbol_has_been_deprecated
#define UART_B1T_B1T_MASK                        This_symbol_has_been_deprecated
#define UART_B1T_B1T_SHIFT                       This_symbol_has_been_deprecated
#define UART_B1T_B1T(x)                          This_symbol_has_been_deprecated
#define UART_SDTH_SDTH_MASK                      This_symbol_has_been_deprecated
#define UART_SDTH_SDTH_SHIFT                     This_symbol_has_been_deprecated
#define UART_SDTH_SDTH(x)                        This_symbol_has_been_deprecated
#define UART_SDTL_SDTL_MASK                      This_symbol_has_been_deprecated
#define UART_SDTL_SDTL_SHIFT                     This_symbol_has_been_deprecated
#define UART_SDTL_SDTL(x)                        This_symbol_has_been_deprecated
#define UART_PRE_PREAMBLE_MASK                   This_symbol_has_been_deprecated
#define UART_PRE_PREAMBLE_SHIFT                  This_symbol_has_been_deprecated
#define UART_PRE_PREAMBLE(x)                     This_symbol_has_been_deprecated
#define UART_TPL_TPL_MASK                        This_symbol_has_been_deprecated
#define UART_TPL_TPL_SHIFT                       This_symbol_has_been_deprecated
#define UART_TPL_TPL(x)                          This_symbol_has_been_deprecated
#define UART_IE_TXFIE_MASK                       This_symbol_has_been_deprecated
#define UART_IE_TXFIE_SHIFT                      This_symbol_has_been_deprecated
#define UART_IE_PSIE_MASK                        This_symbol_has_been_deprecated
#define UART_IE_PSIE_SHIFT                       This_symbol_has_been_deprecated
#define UART_IE_PCTEIE_MASK                      This_symbol_has_been_deprecated
#define UART_IE_PCTEIE_SHIFT                     This_symbol_has_been_deprecated
#define UART_IE_PTXIE_MASK                       This_symbol_has_been_deprecated
#define UART_IE_PTXIE_SHIFT                      This_symbol_has_been_deprecated
#define UART_IE_PRXIE_MASK                       This_symbol_has_been_deprecated
#define UART_IE_PRXIE_SHIFT                      This_symbol_has_been_deprecated
#define UART_IE_ISDIE_MASK                       This_symbol_has_been_deprecated
#define UART_IE_ISDIE_SHIFT                      This_symbol_has_been_deprecated
#define UART_IE_WBEIE_MASK                       This_symbol_has_been_deprecated
#define UART_IE_WBEIE_SHIFT                      This_symbol_has_been_deprecated
#define UART_WB_WBASE_MASK                       This_symbol_has_been_deprecated
#define UART_WB_WBASE_SHIFT                      This_symbol_has_been_deprecated
#define UART_WB_WBASE(x)                         This_symbol_has_been_deprecated
#define UART_S3_TXFF_MASK                        This_symbol_has_been_deprecated
#define UART_S3_TXFF_SHIFT                       This_symbol_has_been_deprecated
#define UART_S3_PSF_MASK                         This_symbol_has_been_deprecated
#define UART_S3_PSF_SHIFT                        This_symbol_has_been_deprecated
#define UART_S3_PCTEF_MASK                       This_symbol_has_been_deprecated
#define UART_S3_PCTEF_SHIFT                      This_symbol_has_been_deprecated
#define UART_S3_PTXF_MASK                        This_symbol_has_been_deprecated
#define UART_S3_PTXF_SHIFT                       This_symbol_has_been_deprecated
#define UART_S3_PRXF_MASK                        This_symbol_has_been_deprecated
#define UART_S3_PRXF_SHIFT                       This_symbol_has_been_deprecated
#define UART_S3_ISD_MASK                         This_symbol_has_been_deprecated
#define UART_S3_ISD_SHIFT                        This_symbol_has_been_deprecated
#define UART_S3_WBEF_MASK                        This_symbol_has_been_deprecated
#define UART_S3_WBEF_SHIFT                       This_symbol_has_been_deprecated
#define UART_S3_PEF_MASK                         This_symbol_has_been_deprecated
#define UART_S3_PEF_SHIFT                        This_symbol_has_been_deprecated
#define UART_S4_FE_MASK                          This_symbol_has_been_deprecated
#define UART_S4_FE_SHIFT                         This_symbol_has_been_deprecated
#define UART_S4_ILCV_MASK                        This_symbol_has_been_deprecated
#define UART_S4_ILCV_SHIFT                       This_symbol_has_been_deprecated
#define UART_S4_CDET_MASK                        This_symbol_has_been_deprecated
#define UART_S4_CDET_SHIFT                       This_symbol_has_been_deprecated
#define UART_S4_CDET(x)                          This_symbol_has_been_deprecated
#define UART_S4_INITF_MASK                       This_symbol_has_been_deprecated
#define UART_S4_INITF_SHIFT                      This_symbol_has_been_deprecated
#define UART_RPL_RPL_MASK                        This_symbol_has_been_deprecated
#define UART_RPL_RPL_SHIFT                       This_symbol_has_been_deprecated
#define UART_RPL_RPL(x)                          This_symbol_has_been_deprecated
#define UART_RPREL_RPREL_MASK                    This_symbol_has_been_deprecated
#define UART_RPREL_RPREL_SHIFT                   This_symbol_has_been_deprecated
#define UART_RPREL_RPREL(x)                      This_symbol_has_been_deprecated
#define UART_CPW_CPW_MASK                        This_symbol_has_been_deprecated
#define UART_CPW_CPW_SHIFT                       This_symbol_has_been_deprecated
#define UART_CPW_CPW(x)                          This_symbol_has_been_deprecated
#define UART_RIDT_RIDT_MASK                      This_symbol_has_been_deprecated
#define UART_RIDT_RIDT_SHIFT                     This_symbol_has_been_deprecated
#define UART_RIDT_RIDT(x)                        This_symbol_has_been_deprecated
#define UART_TIDT_TIDT_MASK                      This_symbol_has_been_deprecated
#define UART_TIDT_TIDT_SHIFT                     This_symbol_has_been_deprecated
#define UART_TIDT_TIDT(x)                        This_symbol_has_been_deprecated

/**
 * @}
 */ /* end of group Backward_Compatibility_Symbols */


#endif  /* #if !defined(MK21D5_H_) */

/* MK21D5.h, eof. */
